In [115]:
import pandas as pd

In [116]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [117]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [118]:
list('321')

['3', '2', '1']

In [137]:
df =  pd.DataFrame(data, list('321'), list('ZYX'))

In [138]:
dt = [[9,6,3], [8,5,2], [7,4,1]]
dt

[[9, 6, 3], [8, 5, 2], [7, 4, 1]]

In [121]:
list('ZYX')

['Z', 'Y', 'X']

In [139]:
dat = pd.DataFrame(dt, list('ZYX'), list('CBA'))

In [140]:
dat

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [124]:
dat.sort_index()
dat.sort_index(axis = 1)
dat

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [125]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [126]:
df.sort_index(inplace = True)

In [127]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [128]:
df.sort_index(inplace = True, axis = 1)

In [129]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [130]:
df.sort_values(by = ['X', 'Y'],inplace = True)

In [131]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [132]:
df.sort_values(by = '3', axis = 1, inplace = True)

In [133]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9